mattjquinn/stm32/Exercise6-1/main.c
#include <stm32f10x.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <stm32f10x_spi.h>
#include "spi.h"

uint8_t txbuf[4], rxbuf[4];
uint16_t txbuf16[4], rxbuf16[4];

void csInit();

main() {
  int i, j;

  csInit();   // Initialize chip select PC03
  spiInit(SPI2);

  for (i = 0; i < 8; i++) {
    for (j = 0; j < 4; j++) {
      txbuf[j] = i * 4 + j;
    }
    GPIO_WriteBit(GPIOC, GPIO_Pin_3, 0);
    spiReadWrite(SPI2, rxbuf, txbuf, 4, SPI_SLOW);
    GPIO_WriteBit(GPIOC, GPIO_Pin_3, 1);
    for (j = 0; j < 4; j++) {
      if (rxbuf[j] != txbuf[j]) {
        assert_failed(__FILE__, __LINE__);
      }
    }
  }

  for (i = 0; i < 8; i++) {
    for (j = 0; j < 4; j++) {
      txbuf16[j] = i * 4 + j + (i << 8);
    }
    GPIO_WriteBit(GPIOC, GPIO_Pin_3, 0);
    spiReadWrite16(SPI2, rxbuf16, txbuf16, 4, SPI_SLOW);
    GPIO_WriteBit(GPIOC, GPIO_Pin_3, 1);
    for (j = 0; j < 4; j++) {
      if (rxbuf16[j] != txbuf16[j]) {
        assert_failed(__FILE__, __LINE__);
      }
    }
  }
}

/*
 * MQUINN 06-27-2015 : This method is not included
 * in "Discovering the STM32 Microcontroller"; I used the following
 * forum thread to help me:
 * https://my.st.com/public/STe2ecommunities/mcu/Lists/STM32Discovery/Flat.aspx?RootFolder=https%3a%2f%2fmy.st.com%2fpublic%2fSTe2ecommunities%2fmcu%2fLists%2fSTM32Discovery%2fSTM32F429I-discovery%20SPI%20Troubles&FolderCTID=0x01200200770978C69A1141439FE559EB459D75800084C20D8867EAD444A5987D47BE638E0F&currentviews=401
 */
void csInit(void) {
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStruct);

  // Initialize chip select to high.
  GPIO_WriteBit(GPIOC, GPIO_Pin_3, 1);
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line) {
  /* Infinite loop; use GDB to find out why we're here. */
  while (1);
}
#endif
